localResults/iothreads_1_pipeline_10_connections_512_payload_100_threads_12.txt
====== SET ======
  1000160 requests completed in 1.21 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1.2 milliseconds
0.00% <= 1.3 milliseconds
0.00% <= 1.4 milliseconds
0.01% <= 1.5 milliseconds
0.01% <= 1.6 milliseconds
0.01% <= 1.7 milliseconds
0.01% <= 1.8 milliseconds
0.01% <= 1.9 milliseconds
0.02% <= 4 milliseconds
0.04% <= 5 milliseconds
65.62% <= 6 milliseconds
93.00% <= 7 milliseconds
97.73% <= 8 milliseconds
98.02% <= 9 milliseconds
98.05% <= 10 milliseconds
98.26% <= 11 milliseconds
98.94% <= 12 milliseconds
99.25% <= 13 milliseconds
99.36% <= 14 milliseconds
99.39% <= 15 milliseconds
99.42% <= 16 milliseconds
99.45% <= 17 milliseconds
99.49% <= 18 milliseconds
99.49% <= 19 milliseconds
99.54% <= 20 milliseconds
99.62% <= 21 milliseconds
99.70% <= 22 milliseconds
99.78% <= 27 milliseconds
99.78% <= 28 milliseconds
99.82% <= 29 milliseconds
99.85% <= 30 milliseconds
99.91% <= 31 milliseconds
99.94% <= 35 milliseconds
99.95% <= 36 milliseconds
100.00% <= 36 milliseconds
827947.06 requests per second

====== GET ======
  1000110 requests completed in 1.22 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.02% <= 4 milliseconds
1.58% <= 5 milliseconds
54.08% <= 6 milliseconds
90.06% <= 7 milliseconds
97.71% <= 8 milliseconds
98.03% <= 9 milliseconds
98.12% <= 10 milliseconds
98.29% <= 11 milliseconds
98.73% <= 12 milliseconds
99.09% <= 13 milliseconds
99.31% <= 14 milliseconds
99.42% <= 15 milliseconds
99.49% <= 18 milliseconds
99.49% <= 21 milliseconds
99.57% <= 22 milliseconds
99.71% <= 23 milliseconds
99.78% <= 24 milliseconds
99.81% <= 25 milliseconds
99.85% <= 26 milliseconds
99.88% <= 27 milliseconds
99.91% <= 28 milliseconds
99.95% <= 29 milliseconds
99.96% <= 33 milliseconds
99.98% <= 34 milliseconds
100.00% <= 34 milliseconds
818420.62 requests per second

====== HSET ======
  1000160 requests completed in 1.27 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.02% <= 3 milliseconds
0.05% <= 4 milliseconds
0.09% <= 5 milliseconds
33.52% <= 6 milliseconds
88.93% <= 7 milliseconds
95.98% <= 8 milliseconds
97.23% <= 9 milliseconds
97.88% <= 10 milliseconds
98.11% <= 11 milliseconds
98.34% <= 12 milliseconds
98.76% <= 13 milliseconds
98.96% <= 14 milliseconds
99.09% <= 15 milliseconds
99.17% <= 16 milliseconds
99.25% <= 17 milliseconds
99.35% <= 18 milliseconds
99.48% <= 19 milliseconds
99.58% <= 20 milliseconds
99.62% <= 21 milliseconds
99.65% <= 22 milliseconds
99.69% <= 23 milliseconds
99.72% <= 24 milliseconds
99.75% <= 25 milliseconds
99.78% <= 26 milliseconds
99.81% <= 27 milliseconds
99.89% <= 28 milliseconds
99.93% <= 29 milliseconds
99.97% <= 30 milliseconds
99.99% <= 31 milliseconds
100.00% <= 41 milliseconds
100.00% <= 41 milliseconds
784439.25 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000140 requests completed in 1.35 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 3 milliseconds
0.03% <= 4 milliseconds
0.06% <= 5 milliseconds
1.02% <= 6 milliseconds
84.74% <= 7 milliseconds
96.86% <= 8 milliseconds
97.86% <= 9 milliseconds
98.30% <= 10 milliseconds
98.42% <= 11 milliseconds
98.42% <= 12 milliseconds
98.60% <= 13 milliseconds
99.04% <= 14 milliseconds
99.18% <= 15 milliseconds
99.28% <= 16 milliseconds
99.33% <= 17 milliseconds
99.45% <= 18 milliseconds
99.49% <= 19 milliseconds
99.50% <= 20 milliseconds
99.53% <= 21 milliseconds
99.57% <= 22 milliseconds
99.61% <= 23 milliseconds
99.64% <= 24 milliseconds
99.67% <= 25 milliseconds
99.70% <= 26 milliseconds
99.74% <= 27 milliseconds
99.78% <= 28 milliseconds
99.88% <= 29 milliseconds
99.93% <= 30 milliseconds
99.96% <= 31 milliseconds
99.99% <= 32 milliseconds
100.00% <= 41 milliseconds
100.00% <= 41 milliseconds
740844.44 requests per second

====== LRANGE_100 (first 100 elements) ======
  1001709 requests completed in 13.06 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.00% <= 26 milliseconds
0.01% <= 27 milliseconds
0.55% <= 28 milliseconds
2.62% <= 29 milliseconds
5.12% <= 30 milliseconds
7.16% <= 31 milliseconds
8.78% <= 32 milliseconds
9.50% <= 33 milliseconds
9.69% <= 34 milliseconds
9.70% <= 39 milliseconds
9.90% <= 40 milliseconds
11.17% <= 41 milliseconds
14.00% <= 42 milliseconds
17.54% <= 43 milliseconds
21.10% <= 44 milliseconds
24.75% <= 45 milliseconds
28.50% <= 46 milliseconds
32.22% <= 47 milliseconds
35.93% <= 48 milliseconds
39.67% <= 49 milliseconds
43.41% <= 50 milliseconds
47.10% <= 51 milliseconds
50.86% <= 52 milliseconds
54.65% <= 53 milliseconds
58.37% <= 54 milliseconds
62.07% <= 55 milliseconds
65.84% <= 56 milliseconds
69.65% <= 57 milliseconds
73.52% <= 58 milliseconds
77.52% <= 59 milliseconds
81.55% <= 60 milliseconds
85.40% <= 61 milliseconds
88.08% <= 62 milliseconds
89.97% <= 63 milliseconds
92.37% <= 64 milliseconds
95.25% <= 65 milliseconds
97.57% <= 66 milliseconds
98.78% <= 67 milliseconds
99.30% <= 68 milliseconds
99.45% <= 69 milliseconds
99.49% <= 70 milliseconds
99.49% <= 71 milliseconds
99.51% <= 72 milliseconds
99.53% <= 73 milliseconds
99.55% <= 74 milliseconds
99.57% <= 75 milliseconds
99.59% <= 76 milliseconds
99.61% <= 77 milliseconds
99.64% <= 78 milliseconds
99.66% <= 79 milliseconds
99.68% <= 80 milliseconds
99.70% <= 81 milliseconds
99.73% <= 82 milliseconds
99.75% <= 83 milliseconds
99.78% <= 84 milliseconds
99.80% <= 85 milliseconds
99.83% <= 86 milliseconds
99.85% <= 87 milliseconds
99.88% <= 88 milliseconds
99.90% <= 101 milliseconds
99.91% <= 102 milliseconds
99.93% <= 103 milliseconds
99.95% <= 104 milliseconds
99.99% <= 105 milliseconds
100.00% <= 105 milliseconds
76671.19 requests per second

====== MSET (10 keys) ======
  1000260 requests completed in 3.78 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 13 milliseconds
0.03% <= 14 milliseconds
0.07% <= 15 milliseconds
0.10% <= 17 milliseconds
0.10% <= 18 milliseconds
75.47% <= 19 milliseconds
90.58% <= 20 milliseconds
98.05% <= 21 milliseconds
98.99% <= 36 milliseconds
99.01% <= 37 milliseconds
99.34% <= 38 milliseconds
99.40% <= 39 milliseconds
99.54% <= 40 milliseconds
99.57% <= 41 milliseconds
99.58% <= 47 milliseconds
99.61% <= 48 milliseconds
99.67% <= 49 milliseconds
99.74% <= 50 milliseconds
99.81% <= 51 milliseconds
99.88% <= 52 milliseconds
99.95% <= 53 milliseconds
99.98% <= 54 milliseconds
100.00% <= 59 milliseconds
100.00% <= 59 milliseconds
264549.06 requests per second