localResults/iothreads_1_pipeline_10_connections_512_payload_3_threads_12.txt
====== SET ======
  1000110 requests completed in 1.28 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1.2 milliseconds
0.00% <= 1.3 milliseconds
0.00% <= 1.4 milliseconds
0.01% <= 1.5 milliseconds
0.01% <= 1.6 milliseconds
0.01% <= 1.7 milliseconds
0.01% <= 1.8 milliseconds
0.02% <= 1.9 milliseconds
0.02% <= 2 milliseconds
0.02% <= 5 milliseconds
28.73% <= 6 milliseconds
84.17% <= 7 milliseconds
96.55% <= 8 milliseconds
97.48% <= 9 milliseconds
97.89% <= 10 milliseconds
98.31% <= 11 milliseconds
98.61% <= 12 milliseconds
98.94% <= 13 milliseconds
99.36% <= 14 milliseconds
99.41% <= 15 milliseconds
99.45% <= 16 milliseconds
99.48% <= 17 milliseconds
99.48% <= 18 milliseconds
99.48% <= 19 milliseconds
99.49% <= 20 milliseconds
99.50% <= 21 milliseconds
99.58% <= 22 milliseconds
99.67% <= 23 milliseconds
99.77% <= 27 milliseconds
99.78% <= 28 milliseconds
99.81% <= 29 milliseconds
99.85% <= 30 milliseconds
99.90% <= 31 milliseconds
99.94% <= 36 milliseconds
99.96% <= 37 milliseconds
100.00% <= 37 milliseconds
781946.81 requests per second

====== GET ======
  1000110 requests completed in 1.19 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.02% <= 3 milliseconds
0.05% <= 4 milliseconds
0.83% <= 5 milliseconds
71.93% <= 6 milliseconds
95.44% <= 7 milliseconds
97.73% <= 8 milliseconds
97.92% <= 9 milliseconds
98.21% <= 10 milliseconds
98.32% <= 11 milliseconds
98.74% <= 12 milliseconds
98.95% <= 13 milliseconds
99.07% <= 14 milliseconds
99.18% <= 15 milliseconds
99.28% <= 16 milliseconds
99.40% <= 17 milliseconds
99.50% <= 18 milliseconds
99.60% <= 19 milliseconds
99.66% <= 20 milliseconds
99.69% <= 21 milliseconds
99.73% <= 22 milliseconds
99.77% <= 23 milliseconds
99.89% <= 24 milliseconds
99.93% <= 25 milliseconds
99.97% <= 26 milliseconds
99.98% <= 28 milliseconds
100.00% <= 36 milliseconds
100.00% <= 36 milliseconds
842552.62 requests per second

====== HSET ======
  1000120 requests completed in 1.26 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.01% <= 1 milliseconds
0.02% <= 3 milliseconds
0.10% <= 4 milliseconds
0.24% <= 5 milliseconds
6.50% <= 6 milliseconds
91.20% <= 7 milliseconds
98.67% <= 8 milliseconds
99.03% <= 9 milliseconds
99.09% <= 10 milliseconds
99.09% <= 11 milliseconds
99.10% <= 12 milliseconds
99.83% <= 13 milliseconds
99.96% <= 14 milliseconds
100.00% <= 14 milliseconds
795640.44 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000110 requests completed in 1.36 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.02% <= 3 milliseconds
0.05% <= 4 milliseconds
0.05% <= 5 milliseconds
4.97% <= 6 milliseconds
85.67% <= 7 milliseconds
94.30% <= 8 milliseconds
97.72% <= 9 milliseconds
98.02% <= 10 milliseconds
98.25% <= 11 milliseconds
98.28% <= 12 milliseconds
98.30% <= 13 milliseconds
98.90% <= 14 milliseconds
99.00% <= 15 milliseconds
99.10% <= 16 milliseconds
99.17% <= 17 milliseconds
99.25% <= 18 milliseconds
99.34% <= 19 milliseconds
99.48% <= 20 milliseconds
99.61% <= 21 milliseconds
99.64% <= 22 milliseconds
99.68% <= 23 milliseconds
99.71% <= 24 milliseconds
99.74% <= 25 milliseconds
99.77% <= 26 milliseconds
99.80% <= 27 milliseconds
99.84% <= 28 milliseconds
99.92% <= 29 milliseconds
99.95% <= 30 milliseconds
99.99% <= 31 milliseconds
100.00% <= 32 milliseconds
100.00% <= 42 milliseconds
100.00% <= 42 milliseconds
733756.38 requests per second

====== LRANGE_100 (first 100 elements) ======
  1000460 requests completed in 6.56 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 16 milliseconds
0.01% <= 17 milliseconds
0.04% <= 18 milliseconds
0.11% <= 19 milliseconds
0.18% <= 20 milliseconds
0.24% <= 21 milliseconds
0.28% <= 22 milliseconds
0.30% <= 23 milliseconds
0.32% <= 24 milliseconds
0.70% <= 25 milliseconds
1.78% <= 26 milliseconds
5.21% <= 27 milliseconds
11.87% <= 28 milliseconds
21.68% <= 29 milliseconds
34.81% <= 30 milliseconds
49.66% <= 31 milliseconds
64.85% <= 32 milliseconds
77.38% <= 33 milliseconds
86.70% <= 34 milliseconds
92.97% <= 35 milliseconds
96.23% <= 36 milliseconds
97.93% <= 37 milliseconds
98.56% <= 38 milliseconds
98.87% <= 39 milliseconds
99.08% <= 40 milliseconds
99.25% <= 41 milliseconds
99.38% <= 42 milliseconds
99.49% <= 43 milliseconds
99.55% <= 44 milliseconds
99.60% <= 45 milliseconds
99.64% <= 46 milliseconds
99.67% <= 47 milliseconds
99.71% <= 59 milliseconds
99.71% <= 60 milliseconds
99.73% <= 61 milliseconds
99.77% <= 62 milliseconds
99.82% <= 63 milliseconds
99.85% <= 64 milliseconds
99.88% <= 65 milliseconds
99.92% <= 66 milliseconds
99.95% <= 67 milliseconds
99.97% <= 68 milliseconds
99.99% <= 69 milliseconds
100.00% <= 70 milliseconds
100.00% <= 70 milliseconds
152509.14 requests per second

====== MSET (10 keys) ======
  1000260 requests completed in 3.05 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 10 milliseconds
0.01% <= 11 milliseconds
0.04% <= 12 milliseconds
0.07% <= 13 milliseconds
0.09% <= 14 milliseconds
16.00% <= 15 milliseconds
93.67% <= 16 milliseconds
96.05% <= 17 milliseconds
99.08% <= 18 milliseconds
99.10% <= 29 milliseconds
99.14% <= 30 milliseconds
99.44% <= 31 milliseconds
99.47% <= 32 milliseconds
99.49% <= 33 milliseconds
99.49% <= 36 milliseconds
99.49% <= 37 milliseconds
99.54% <= 38 milliseconds
99.58% <= 43 milliseconds
99.59% <= 44 milliseconds
99.64% <= 45 milliseconds
99.72% <= 46 milliseconds
99.79% <= 47 milliseconds
99.86% <= 48 milliseconds
99.94% <= 49 milliseconds
99.98% <= 50 milliseconds
100.00% <= 54 milliseconds
100.00% <= 54 milliseconds
328384.78 requests per second